Repository: huaium/BatchPrinter
Catalog: BatchPrinter/Localizable.xcstrings
Source language: en
Languages: zh_hans

# alert.error.title
source: Error
zh_hans: 错误

# app.subtitle
source: Batch-print local Word and PDF files through native macOS printing and Word automation.
zh_hans: 通过 macOS 原生打印和 Word 自动化批量打印本地 Word 与 PDF 文件。

# common.cancel
source: Cancel
zh_hans: 取消

# common.no
source: No
zh_hans: 否

# common.off
source: Off
zh_hans: 关

# common.ok
source: OK
zh_hans: 确定

# common.on
source: On
zh_hans: 开

# common.yes
source: Yes
zh_hans: 是

# controls.cancelling
source: Cancelling...
zh_hans: 取消中...

# controls.choose_folder
source: Choose Folder
zh_hans: 选择文件夹

# controls.clear
source: Clear
zh_hans: 清空

# controls.clear_logs
source: Clear Logs
zh_hans: 清空日志

# controls.copy_logs
source: Copy Logs
zh_hans: 复制日志

# controls.language
source: Language
zh_hans: 语言

# controls.no_printer
source: No printer
zh_hans: 无打印机

# controls.not_selected
source: Not selected
zh_hans: 未选择

# controls.page_range
source: Page range
zh_hans: 页码范围

# controls.page_range.help
source: Page range format help
zh_hans: 页码范围格式说明

# controls.preprocess
source: Prepare PDFs
zh_hans: 预处理

# controls.preprocess_folder
source: PDF output folder
zh_hans: 预处理文件夹

# controls.preprocess.help
source: What happens when preprocessing starts
zh_hans: 查看预处理开始后的行为

# controls.preprocessing
source: Preprocessing...
zh_hans: 预处理中...

# controls.print_all
source: Print All
zh_hans: 打印全部

# controls.print_selected
source: Print Selected
zh_hans: 打印选中

# controls.printer
source: Printer
zh_hans: 打印机

# controls.refresh_files
source: Refresh Files
zh_hans: 刷新文件

# controls.refresh_printers
source: Refresh Printers
zh_hans: 刷新打印机

# controls.scan_subfolders
source: Scan subfolders
zh_hans: 扫描子文件夹

# controls.show_only_failures
source: Show only failures
zh_hans: 仅显示失败项

# error.cannot_clear_while_busy
source: Cannot clear while printing or preprocessing is running.
zh_hans: 正在打印或预处理时无法清空。

# error.cannot_refresh_while_busy
source: Cannot refresh files while printing or preprocessing is running.
zh_hans: 正在打印或预处理时无法刷新文件。

# error.no_jobs_selected
source: No jobs selected.
zh_hans: 未选择任务。

# error.no_jobs_to_preprocess
source: No jobs to preprocess.
zh_hans: 没有可预处理的任务。

# error.no_printer_selected
source: No printer selected. Add/select a printer first.
zh_hans: 未选择打印机，请先添加或选择打印机。

# error.preprocess_required_physical_printer
source: Preprocess required before printing to a physical printer.
zh_hans: 打印到实体打印机前必须先预处理。

# error.preprocess_still_running
source: Preprocess is still running. Wait for it to finish before printing.
zh_hans: 预处理仍在进行中，请等待完成后再打印。

# error.select_folder_first
source: Select a folder first.
zh_hans: 请先选择文件夹。

# error.select_preprocess_output_first
source: Select a preprocess output folder first.
zh_hans: 请先选择预处理输出文件夹。

# error.select_print_pdf_output_folder
source: Select an output folder for Print to PDF.
zh_hans: 请为“打印为 PDF”选择输出文件夹。

# error.unable_prepare_temp_folder
source: Unable to prepare temporary folder: %@
zh_hans: 无法准备临时文件夹：%@

# error.word_not_found_install_first
source: Microsoft Word was not found. Install Word first.
zh_hans: 未找到 Microsoft Word，请先安装 Word。

# error.word_not_found_or_preprocess_first
source: Microsoft Word was not found. Install Word or preprocess all files first.
zh_hans: 未找到 Microsoft Word，请先安装 Word 或先完成全部预处理。

# header.folder
source: Folder
zh_hans: 文件夹

# header.no_folder_selected
source: No folder selected
zh_hans: 未选择文件夹

# help.logs.line1
source: Review the activity log to troubleshoot failures. Use Copy Logs when sharing issue details.
zh_hans: 查看活动日志可帮助排查失败原因。分享问题详情时可使用“复制日志”。

# help.logs.title
source: Logs and Troubleshooting
zh_hans: 日志与故障排查

# help.menu.title
source: BatchPrinter Help
zh_hans: BatchPrinter 帮助

# help.permissions.line1
source: If files cannot be printed, grant BatchPrinter Full Disk Access in System Settings > Privacy & Security.
zh_hans: 如果文件无法打印，请在“系统设置 > 隐私与安全性”中为 BatchPrinter 授予“完全磁盘访问权限”。

# help.permissions.title
source: Permissions
zh_hans: 权限设置

# help.preprocess.line1
source: Enable preprocessing when Word files require cleanup before printing.
zh_hans: 当 Word 文件在打印前需要清理处理时，请启用预处理。

# help.preprocess.line2
source: Choose whether to keep generated temporary PDFs after the job completes.
zh_hans: 可选择在任务完成后是否保留生成的临时 PDF。

# help.preprocess.title
source: Preprocessing
zh_hans: 预处理

# help.quick_start.step1
source: Choose a folder that contains Word or PDF files.
zh_hans: 选择包含 Word 或 PDF 文件的文件夹。

# help.quick_start.step2
source: Select a printer and page settings.
zh_hans: 选择打印机与页面设置。

# help.quick_start.step3
source: Review detected files and start batch printing.
zh_hans: 检查识别到的文件后开始批量打印。

# help.quick_start.step4
source: Use the logs panel to monitor progress and errors.
zh_hans: 通过日志面板查看进度与错误信息。

# help.quick_start.title
source: Quick Start
zh_hans: 快速开始

# help.subtitle
source: Use these tips to configure and run print jobs reliably.
zh_hans: 按以下提示配置并执行打印任务，以获得更稳定的结果。

# language.english
source: English
zh_hans: 英文

# language.simplified_chinese
source: Simplified Chinese
zh_hans: 简体中文

# language.system
source: System
zh_hans: 跟随系统

# log.cancellation_requested
source: Cancellation requested. Current document may still finish first.
zh_hans: 已请求取消。当前文档可能仍会先完成。

# log.cannot_print_preprocess_missing_count
source: Cannot print: preprocess missing for %d file(s).
zh_hans: 无法打印：%d 个文件缺少预处理。

# log.cleared_job_list
source: Cleared job list.
zh_hans: 已清空任务列表。

# log.copied_logs
source: Copied logs to clipboard.
zh_hans: 已复制日志到剪贴板。

# log.folder_updated_refresh_later
source: Folder updated. Refresh files after current task finishes.
zh_hans: 文件夹已更新。当前任务结束后请刷新文件。

# log.no_matching_files
source: No matching files were found. Hidden files and Word lock files (~$...) are skipped.
zh_hans: 未找到匹配文件。已跳过隐藏文件和 Word 锁定文件（~$...）。

# log.no_printer_found
source: No printer found on this Mac.
zh_hans: 此 Mac 未发现打印机。

# log.page_count_unavailable_source_pdf
source: Page count unavailable for source PDF: %@
zh_hans: 无法获取源 PDF 页数：%@

# log.preprocess_failed
source: Preprocess failed: %@ - %@
zh_hans: 预处理失败：%@ - %@

# log.preprocess_finished
source: Preprocess finished.
zh_hans: 预处理完成。

# log.preprocess_missing_output_folder
source: Preprocess failed: missing output folder for %@
zh_hans: 预处理失败：%@ 缺少输出文件夹

# log.preprocess_output_folder
source: Preprocess output folder: %@
zh_hans: 预处理输出文件夹：%@

# log.preprocess_prepare_temp_failed
source: Preprocess failed to prepare temporary folder: %@
zh_hans: 预处理准备临时文件夹失败：%@

# log.preprocess_required_file
source: Preprocess required: %@
zh_hans: 需要预处理：%@

# log.preprocess_skipped_pdf_source
source: Preprocess skipped (PDF source): %@ (%d pages)
zh_hans: 预处理已跳过（源文件为 PDF）：%@（%d 页）

# log.preprocess_start_failed
source: Preprocess failed to start: %@
zh_hans: 预处理启动失败：%@

# log.preprocessed_success
source: Preprocessed: %@ -> %@ (%d pages)
zh_hans: 预处理完成：%@ -> %@（%d 页）

# log.preprocessing_files
source: Preprocessing %d file(s) to PDF...
zh_hans: 正在将 %d 个文件预处理为 PDF...

# log.print_failed
source: Print failed: %@ - %@
zh_hans: 打印失败：%@ - %@

# log.print_pdf_output_folder
source: Print-to-PDF output folder: %@
zh_hans: 打印为 PDF 输出文件夹：%@

# log.print_run_finished
source: Print run finished.
zh_hans: 打印任务结束。

# log.printed_successfully
source: Printed successfully: %@
zh_hans: 打印成功：%@

# log.printer_setup_failed
source: Printer setup failed: %@
zh_hans: 打印机设置失败：%@

# log.printing_file
source: Printing: %@
zh_hans: 正在打印：%@

# log.scan_failed
source: Scan failed: %@
zh_hans: 扫描失败：%@

# log.scanned_printable_docs
source: Scanned %d printable document(s) (.doc/.docx/.pdf).
zh_hans: 已扫描到 %d 个可打印文档（.doc/.docx/.pdf）。

# log.scanning_files
source: Scanning files (scan subfolders: %@).
zh_hans: 正在扫描文件（扫描子文件夹：%@）。

# log.selected_folder
source: Selected folder: %@
zh_hans: 已选择文件夹：%@

# log.starting_print_run
source: Starting print run for %d job(s).
zh_hans: 开始打印，共 %d 个任务。

# log.stopping_run_word_permission
source: Stopping run because Word automation permission is not granted.
zh_hans: 因未授予 Word 自动化权限，已停止本次任务。

# log.using_print_pdf_output_folder
source: Using Print-to-PDF output folder: %@
zh_hans: 使用“打印为 PDF”输出文件夹：%@

# log.using_printer
source: Using printer: %@
zh_hans: 使用打印机：%@

# log.using_temp_preprocess_folder
source: Using temporary preprocess folder: %@
zh_hans: 使用临时预处理文件夹：%@

# logs.empty
source: No logs yet.
zh_hans: 暂无日志。

# logs.title
source: Logs
zh_hans: 日志

# message.cancelled_before_printing
source: Cancelled before printing.
zh_hans: 打印前已取消。

# message.exporting_to_pdf_in_word
source: Exporting to PDF in Microsoft Word...
zh_hans: 正在 Microsoft Word 中导出为 PDF...

# message.generating_from_preprocessed_pdf
source: Generating output from preprocessed PDF...
zh_hans: 正在从预处理 PDF 生成输出...

# message.printing_preprocessed_pdf
source: Printing preprocessed PDF...
zh_hans: 正在打印预处理 PDF...

# message.sending_to_word
source: Sending to Microsoft Word...
zh_hans: 正在发送到 Microsoft Word...

# page_range.info.line1
source: Supported formats:
zh_hans: 支持格式：

# page_range.info.line2
source: • Single page: 3
zh_hans: • 单页：3

# page_range.info.line3
source: • Range: 2-6
zh_hans: • 区间：2-6

# page_range.info.line4
source: • Comma-separated pages: 1,2,5 or 4, 2, 1
zh_hans: • 逗号分隔：1,2,5 或 4, 2, 1

# page_range.info.line5
source: Whitespace is ignored. Leave blank for all pages.
zh_hans: 会忽略空格。留空表示全部页。

# page_range.info.title
source: Page Range Format
zh_hans: 页码范围格式

# panel.choose
source: Choose
zh_hans: 选择

# panel.choose_folder.message
source: Select a folder that contains Word or PDF files.
zh_hans: 请选择包含 Word 或 PDF 文件的文件夹。

# panel.preprocess_output.message
source: Select output folder for preprocessed PDF files.
zh_hans: 请选择预处理 PDF 文件的输出文件夹。

# panel.print_pdf_output.message
source: Select output folder for Print to PDF files.
zh_hans: 请选择“打印为 PDF”的输出文件夹。

# preprocess.info.line1
source: When you click Preprocess, the app asks where preprocessed PDFs should be written:
zh_hans: 点击“预处理”后，应用会询问预处理 PDF 的写入位置：

# preprocess.info.line2
source: • Use System Temporary Folder: writes to a macOS temp folder managed by the system.
zh_hans: • 使用系统临时文件夹：写入 macOS 管理的临时目录。

# preprocess.info.line3
source: • Choose Output Folder: lets you pick a folder and saves preprocessed PDFs there.
zh_hans: • 选择输出文件夹...：让你选择一个目录并将预处理 PDF 保存到其中。

# preprocess.info.line4
source: This choice is asked each time before preprocessing starts.
zh_hans: 每次开始预处理前都会询问该选项。

# preprocess.info.title
source: Preprocess Behavior
zh_hans: 预处理行为

# preprocess.output_dialog.choose_folder
source: Choose Output Folder
zh_hans: 选择输出文件夹...

# preprocess.output_dialog.message
source: Before preprocessing, choose where generated temporary PDFs should be written.
zh_hans: 开始预处理前，请选择生成的临时 PDF 写入位置。

# preprocess.output_dialog.title
source: Preprocess Output Folder
zh_hans: 预处理输出文件夹

# preprocess.output_dialog.use_system_temp
source: Use System Temporary Folder
zh_hans: 使用系统临时文件夹

# printer.virtual_pdf
source: Print to PDF
zh_hans: 打印为 PDF

# status.cancelled
source: Cancelled
zh_hans: 已取消

# status.failed
source: Failed
zh_hans: 失败

# status.pending
source: Pending
zh_hans: 待处理

# status.printing
source: Printing
zh_hans: 打印中

# status.skipped
source: Skipped
zh_hans: 已跳过

# status.success
source: Printed
zh_hans: 已打印

# summary.format
source: Total: %d Printed: %d Failed: %d Skipped: %d Cancelled: %d
zh_hans: 总计: %d 已打印: %d 失败: %d 跳过: %d 已取消: %d

# table.all_pages
source: All
zh_hans: 全部

# table.copies
source: Copies
zh_hans: 份数

# table.file
source: File
zh_hans: 文件

# table.message
source: Message
zh_hans: 消息

# table.pages
source: Pages
zh_hans: 页码

# table.path
source: Path
zh_hans: 路径

# table.preprocessed
source: Preprocessed
zh_hans: 已预处理

# table.printed_at
source: Printed At
zh_hans: 打印时间

# table.reveal_in_finder
source: Reveal in Finder
zh_hans: 在 Finder 中显示

# table.status
source: Status
zh_hans: 状态

# table.title
source: Print Queue
zh_hans: 打印队列

# table.total
source: Total
zh_hans: 总页数

# ui.activity
source: Activity
zh_hans: 活动记录

# ui.choose_folder_hint
source: Add your Word and PDF files, then choose a printer.
zh_hans: 添加 Word 和 PDF 文件，然后选择打印机。

# ui.choose_folder_title
source: Choose a folder to get started
zh_hans: 选择文件夹以开始

# ui.empty_hint
source: Choose a folder containing Word or PDF documents.
zh_hans: 选择包含 Word 或 PDF 文档的文件夹。

# ui.empty_title
source: Your files will appear here
zh_hans: 文件将显示在这里

# ui.file_count
source: %lld files
zh_hans: %lld 个文件

# ui.file_details
source: Selected file details
zh_hans: 所选文件详情

# ui.options
source: Preprocess
zh_hans: 预处理

# word.error.applescript_compile_failed
source: AppleScript compile failed: %@
zh_hans: AppleScript 编译失败：%@

# word.error.applescript_execution_failed
source: AppleScript execution failed: %@
zh_hans: AppleScript 执行失败：%@

# word.error.cannot_read_exported_pdf
source: Cannot read exported PDF.
zh_hans: 无法读取导出的 PDF。

# word.error.exported_pdf_no_pages
source: Exported PDF has no pages.
zh_hans: 导出的 PDF 没有页面。

# word.error.invalid_copies
source: Invalid copies value '%d'. Copies must be at least 1.
zh_hans: 份数值“%d”无效。份数至少为 1。

# word.error.invalid_page_range
source: Invalid page range '%@'. Use formats like '3', '2-6', or '1,4,2'.
zh_hans: 页码范围无效“%@”。请使用“3”、“2-6”或“1,4,2”等格式。

# word.error.no_printer_available
source: No printer is available on this Mac. Add a printer in System Settings first.
zh_hans: 此 Mac 没有可用打印机。请先在系统设置中添加打印机。

# word.error.not_authorized
source: Not authorized to control Microsoft Word. Enable permission in System Settings > Privacy & Security > Automation, then allow this app to control Microsoft Word.
zh_hans: 没有控制 Microsoft Word 的权限。 请在“系统设置 > 隐私与安全性 > 自动化”中允许此应用控制 Microsoft Word。

# word.error.page_count_unavailable
source: Unable to read page count for %@.
zh_hans: 无法读取 %@ 的页数。

# word.error.pdf_generation_failed
source: Failed to generate PDF output: %@
zh_hans: 生成 PDF 输出失败：%@

# word.error.pdf_print_failed
source: Failed to print preprocessed PDF: %@
zh_hans: 打印预处理 PDF 失败：%@

# word.error.printer_not_found
source: Selected printer was not found: %@
zh_hans: 未找到所选打印机：%@

# word.error.printer_selection_failed
source: Failed to select printer: %@
zh_hans: 选择打印机失败：%@

# word.error.unable_copy_page
source: Unable to copy page %d.
zh_hans: 无法复制第 %d 页。

# word.error.unable_create_applescript
source: Unable to create NSAppleScript instance.
zh_hans: 无法创建 NSAppleScript 实例。

# word.error.unable_write_copy
source: Unable to write copy at %@.
zh_hans: 无法写入副本到 %@。

# word.error.unable_write_pdf
source: Unable to write PDF to %@.
zh_hans: 无法将 PDF 写入 %@。

# word.error.unknown_applescript
source: Unknown AppleScript error.
zh_hans: 未知 AppleScript 错误。

# word.error.word_not_installed
source: Microsoft Word is not installed or its bundle identifier cannot be found.
zh_hans: 未安装 Microsoft Word，或找不到其 bundle identifier。

# word.message.printed
source: Printed
zh_hans: 已打印

# word.message.saved_pdf_path
source: Saved PDF: %@
zh_hans: 已保存 PDF：%@

# word.message.sent_preprocessed_pdf
source: Sent preprocessed PDF to printer.
zh_hans: 已将预处理 PDF 发送到打印机。
